{
  "data": [
    {
      "year": "2016",
      "entries": [
        {
          "author": "Michael Balzary",
          "date": "September 9, 2016",
          "recipient": "",
          "subject": "",
          "body": "dear friends,<br />there was a time in years gone by that i would write these things called ‘flea mails’ where i would pontificate, spew, spiel, write a bunch of nonsense and on rare occasion say something of value. i have decided to resume this practice, and this it, i’m doing it.<br />i don’t like to use capital letters because i am too lazy to press the extra buttons on my computer, if that is disheartening, feel free to be disappointed in me. i have poor grammar and a pretty shoddy mind in general, but my aim is true and my motives are pure.<br />i just listened to the new nick cave and the bad seeds record ‘skeleton tree’. It is just so powerful, beautiful, flexible like the ocean of beautiful melancholy from which is birthed, and impenetrable as the hardest substance on earth, so fucking hard, i am absolutely blown away. skeleton tree. none of the obvious moves that the rest of us resort to, just the most sacred essence of what is beautiful about the human condition, making sense of it all. so much love. my heart is full. listening to it was like taking a warm bath when i was frozen and naked in a snow blizzard. man, what a record. thanks to nick cave and the bad seeds for letting us all in on it.<br />some of you might have seen that some weeks back, i befriended a lowland mountain gorilla named koko. Koko speaks sign language very well, and understands spoken english very well also. If i was capable of articulating the profundity of the feeling i had when we stared meaningfully into each others eyes, the love and compassion i felt there, the understanding from one creature to another, i would be a very great writer indeed. I had known about koko for many years, and had always fantasized about playing bass for her to see if she would connect with a rhythm, experience the kind of trance that i do when i lose myself in a dope groove. she rarely meets new people and when she does, doesn’t always let them come into the enclosure where she lives. I stood outside her enclosure and played bass for her, then she enthusiastically signed to me “koko loves!” “come visit, hurry!” my heart was touched and i went in there with her and we took turns playing the bass and hung out playing games and chatting for a couple of hours, it was just the most beautiful thing. i love koko with all my heart, she was kind and intelligent, and understood so much about my world, i felt like such an ignoramus and a fool for how little i was able to decipher about hers, all the gorilla intelligence that she has, that I was unable to see. As a human, it is mind boggling to us that an animal can do things that we relate to, human things. But for us to be able to speak in gorilla? to achieve some of the telepathic communication, and understanding of things that we are completely unable comprehend? now that would be an accomplishment.<br />I am in stockholm right now, we are playing here tomorrow night. been on tour for about three months now, we started bout a month before we put our last record 'the getaway’. It has warmed my heart to be met with so much excitement, for us all to get together and make these gigs happen, it is a spiritual experience for me each night. I yearn to be a vehicle of infinite love for all of you, to let it all come through, to vibrate like a fucking crazed animal. i love you, the tour continues, the rocking goes on, i am a humble student.<br />-flea"
        }
      ]
    },
    {
      "year": "2014",
      "entries": [
        {
          "author": "Michael Balzary",
          "date": "June 15, 2014",
          "recipient": "",
          "subject": "",
          "body": "I have had a powerful paternal instinct since I was a kid. I wanted to be a dad when I had no business being one. Luckily my teenage girlfriend was much more sensible than me in that regard. In fact, it could easily be sensibly argued that I was completely unprepared and too immature to be a dad when I had my first child at the age of 25 (going on 15 emotionally). But man, I always loved the idea of having kids; they seemed like so much fun, partly, it occurs to me, just because I could get away with it, to create my own world independent of the cruelness that seemed so prevalent out there.<br />When one hears about someone else having a baby, it is such a happy thing, and congratulations and well wishes around. But, having your own baby is the most magical, shockingly unbelievable miracle that ever occurred in the universe.<br />When Clara was born in 1988, it was the most glorious moment of my life. I rose above the birthing scene and looked down at her beautiful and totally spent mama radiating love, and me, weeping, scissors in hand cutting the umbilical cord. Driving home with that little swaddling babe was the greatest drive of my life. Never before did I feel such a profound sense of purpose. Everything I did in my life from then on became a richer experience. Every note that I played, every basketball I that bounced, every book that I read, every prayer that I offered, I did to nurture myself inside and out, so that I might be a better parent for her. I quit doing drugs and began the painful journey of working through my own fears so that I might be a kinder, stronger, more conscious person. Clara gave me everything.<br />Being a father offers the greatest opportunity to love…the chance to learn what it is to be selfless, and to reap the greatest rewards from your work. The greatest parenting advice that I ever got was from the great Maya Angelou, who said “your only responsibility as a parent is to see the sun rise and set every time your child walks into the room.”<br />As men, we define ourselves by the quality of our parenting. In no other way are our weaknesses and strengths more apparent. I have been a great, loving, nurturing, inspiring dad, and I have failed miserably as a dad many times and been a short-tempered, selfish jerk. But no matter what, nothing is more important to me, and I will continue strive to get better at it.<br />My relationship with my own father has been interesting. He left when I was six years old and went to live in another country. My mother married a new man –a complicated guy — who had a serious substance-abuse problem and was not very available to be a parent. As a result there was never really a dad around, and I ran wild in the street getting into all kinds of craziness. I am grateful for everything exactly as it is and wouldn’t trade it for any other life, but I definitely did not experience any kind of a close son/father relationship.<br />This situation worked for me and against me with my own fathering skills. In one way I have had no role model to study, but in a deeply positive way, I have been even more determined to give my kids everything that I never had, to love them and to provide them with every opportunity to allow their spirits to soar.<br />My emptiness taught me what I believe to be the cure for that sense of desperation and of longing–I am full of love for both of my fathers. Over time, I developed a loving relationship with my real dad. We got to know each other when I was in my 30s. My stepfather, who passed away, gave me the gift of music, and loved me the best that he knew how, given his own circumstances. Though my childhood was without parental guidance, it gave me an opportunity to go my own way.<br />When my oldest daughter was 17 years old — and preparing to go to college — I had another little girl named Sunny. It has been the most amazing experience to raise up one little whippersnapper, have her grow up and leave the nest (not really), and then segue right into another little girl. I learned a lot the first time around, and I think I am a little better at being a present papa. But, it’s not about me, it’s about her. Every morning when I get up bleary-eyed and stumble into the kitchen to make her breakfast, and tell her “for crying out loud stop fooling around and go brush your teeth!” and we do our morning dance and drive to school listening to the terrible pop music that she likes, I know in the depths of my being, that nothing ever could make me happier. I am in awe of my kids, and to all the other papas out there I say, “Hooray.”"
        }
      ]
    },
    {
      "year": "2012",
      "entries": [
        {
          "author": "Michael Balzary",
          "date": "June 15, 2014",
          "recipient": "",
          "subject": "",
          "body": ""
        }
      ]
    }
  ]
}

